/*********************************************************************************************************************
 *     COPYRIGHT NOTICE
 *     Copyright (c) 2023,CNU_W.PIE
 *     All rights reserved.
 *
 *     除注明出处外，以下所有内容版权均属胖胖个人所有，未经允许，不得用于商业用途，
 *     修改内容时必须保留PP的版权声明。
 *     Except where indicated, the copyright of all the contents below is owned by PP 
 *     and can not be used for commercial purposes without permission. 
 *     The copyright notice of PP must be preserved when modifying the content.
 *
 * @file       CNU_PIE_I2C.c
 * @brief      I2C
 * @author     胖胖
 * @version    v1.0
 * @note       NULL
 * @date       2023-07-26
 ********************************************************************************************************************/
#include "CNU_PIE_I2C.h"
#include "CNU_PIE_GPIO.h"

 /**************************************************************************************************************************
 * @brief  I2C主机引脚初始化
 * @exampleCode
 *      I2C_Init_Master(IIC_1, 400*1000, 0 , 1); //初始化I2C1 总线速率400k 禁止总线自动发送 开启I2C总线
 * @endcode
 * @param[in]  I2C_enum       IIC通道枚举
 * @param[in]  I2C_BUS_Rate   IIC总线速率              
 * @param[in]  I2C_WDTA_EN    IIC自动发送位
 * @param[in]  I2C_Enable     IIC使能位
***************************************************************************************************************************/
void	I2C_Init_Master(IIC_ENUM I2C_enum , uint32_t I2C_BUS_Rate , uint8_t I2C_WDTA_EN , uint8_t I2C_Enable)
{
  uint8_t Bus_Speed;
	switch(I2C_enum)
    {
    case IIC_1:
        P_SW2 |= (0x00<<4);	//SCL:P1.5	SDA:P1.4
        break;
    case IIC_2:
        P_SW2 |= (0x01<<4);	//SCL:P2.5	SDA:P2.4
        break;
    case IIC_3:
        P_SW2 |= (0x02<<4);	//SCL:P7.7	SDA:P7.6
        break;
    case IIC_4:
        P_SW2 |= (0x03<<4);	//SCL:P3.2	SDA:P3.3
        break;
    }

	I2CCFG |=  0x40;  //设置当前设备为I2C主机
	I2CMSST = 0x00;		//清除I2C主机状态寄存器
	/* I2C_BUS_Rate=Fosc/2/(Bus_Speed*2+4) */
	Bus_Speed = (uint8_t)(FOSC/4*I2C_BUS_Rate)-4;
	I2CCFG = ((I2CCFG & ~0x3f) | (Bus_Speed & 0x3f));//设置总线速度
  if(I2C_WDTA_EN) I2CMSAUX |= 0x01;//使能自动发送
	else I2CMSAUX &= ~0x01;          //禁止自动发送
	(I2C_Enable==0?(I2CCFG &= ~0x80):(I2CCFG |= 0x80));				
}
 /**************************************************************************************************************************
 * @brief  I2C从机引脚初始化
 * @exampleCode
 *      I2C_Init_Slave(IIC_1, 0xab , 1 , 1 , 1); //初始化I2C1为从机 地址0xab 只接受相匹配地址 开启I2C总线
 * @endcode
 * @param[in]  I2C_enum        IIC通道枚举
 * @param[in]  I2C_Slave_Add   IIC从机地址              
 * @param[in]  I2C_MATCH_EN    IIC从机地址比较
 * @param[in]  I2C_Enable      IIC使能位
***************************************************************************************************************************/
void	I2C_Init_Slave(IIC_ENUM I2C_enum , uint8_t I2C_Slave_Add , uint8_t I2C_MATCH_EN , uint8_t I2C_Enable)
{
	switch(I2C_enum)
    {
    case IIC_1:
        P_SW2 |= (0x00<<4);	//SCL:P1.5	SDA:P1.4
        break;
    case IIC_2:
        P_SW2 |= (0x01<<4);	//SCL:P2.5	SDA:P2.4
        break;
    case IIC_3:
        P_SW2 |= (0x02<<4);	//SCL:P7.7	SDA:P7.6
        break;
    case IIC_4:
        P_SW2 |= (0x03<<4);	//SCL:P3.2	SDA:P3.3
        break;
    }

	I2CCFG &= ~0x40;	//设置当前设备为I2C主机
	I2CSLST = 0x00;		//清除I2C从机状态寄存器
		
//	I2CSLST = 0X00;   //接收中断
//	I2CSLCR = 0x78;   //接受中断
		
  I2CSLADR = ((I2CSLADR & 0x01) | (I2C_Slave_Add << 1));//设置当前设备地址
	if(I2C_MATCH_EN) I2CSLADR &= ~0x01;//使能从机地址比较功能，只接受相匹配地址
	else I2CSLADR |= 0x01;             //禁止从机地址比较功能，接受所有设备地址
	(I2C_Enable==0?(I2CCFG &= ~0x80):(I2CCFG |= 0x80));				
}	
 /**************************************************************************************************************************
 * @brief  获取主机忙碌状态.
 * @brief  内部调用，无需关心
***************************************************************************************************************************/
uint8_t Get_MSBusy_Status(void)
{
	return (I2CMSST & 0x80);
}
 /**************************************************************************************************************************
 * @brief  等待主机模式I2C控制器执行完成I2CMSCR.
 * @brief  内部调用，无需关心
***************************************************************************************************************************/
void Wait()
{
	while (!(I2CMSST & 0x40));
	I2CMSST &= ~0x40;
}
 /**************************************************************************************************************************
 * @brief  I2C总线起始函数.
 * @brief  内部调用，无需关心
***************************************************************************************************************************/
void Start()
{
	I2CMSCR = 0x01;                         //发送START命令
	Wait();
}
 /**************************************************************************************************************************
 * @brief  I2C发送一个字节数据函数.
 * @brief  内部调用，无需关心
***************************************************************************************************************************/
void SendData(char dat)
{
	I2CTXD = dat;                           //写数据到数据缓冲区
	I2CMSCR = 0x02;                         //发送SEND命令
	Wait();
}
 /**************************************************************************************************************************
 * @brief  I2C获取ACK函数.
 * @brief  内部调用，无需关心
***************************************************************************************************************************/
void RecvACK()
{
	I2CMSCR = 0x03;                         //发送读ACK命令
	Wait();
}
 /**************************************************************************************************************************
 * @brief  I2C读取一个字节数据函数.
 * @brief  内部调用，无需关心
***************************************************************************************************************************/
char RecvData()
{
	I2CMSCR = 0x04;                         //发送RECV命令
	Wait();
	return I2CRXD;
}
 /**************************************************************************************************************************
 * @brief  I2C发送ACK函数.
 * @brief  内部调用，无需关心
***************************************************************************************************************************/
void SendACK()
{
	I2CMSST = 0x00;                         //设置ACK信号
	I2CMSCR = 0x05;                         //发送ACK命令
	Wait();
}
 /**************************************************************************************************************************
 * @brief  I2C发送NAK函数.
 * @brief  内部调用，无需关心
***************************************************************************************************************************/
void SendNAK()
{
	I2CMSST = 0x01;                         //设置NAK信号
	I2CMSCR = 0x05;                         //发送ACK命令
	Wait();
}
 /**************************************************************************************************************************
 * @brief  I2C总线停止函数.
 * @brief  内部调用，无需关心
***************************************************************************************************************************/
void Stop()
{
	I2CMSCR = 0x06;                         //发送STOP命令
	Wait();
}
 /**************************************************************************************************************************
 * @brief  I2C发送一个字节数据函数.
 * @brief  内部调用，无需关心
***************************************************************************************************************************/
void SendCmdData(uint8_t cmd, uint8_t dat)
{
	I2CTXD = dat;                           //写数据到数据缓冲区
	I2CMSCR = cmd;                          //设置命令
	Wait();
}
 /**************************************************************************************************************************
 * @brief  I2C写入数据函数
 * @exampleCode
  uint8_t cmd[2];
	cmd[0]=0x00;
	cmd[1]=WrCmd;
  I2C_WriteNbyte(0x7a,cmd[0],&cmd[1],1); //向0x7a为地址的设备 的0x00地址的寄存器 写入 Wrcmd数据 长度1字节
 * @endcode
 * @param[in]  addr    指定地址 
 * @param[in]  reg     寄存器地址              
 * @param[in]  *p      写入数据存储位置
 * @param[in]  number  写入数据个数
***************************************************************************************************************************/
void I2C_WriteNbyte(uint8_t addr, uint8_t reg , uint8_t *p, uint8_t number) reentrant /*  WordAddress,First Data Address,Byte lenth   */
{
	Start();                                //发送起始命令
	SendData(addr);                         //发送设备地址+写命令
	RecvACK();
	SendData(reg);                         //发送存储地址
	RecvACK();
	do
	{
		SendData(*p++);
		RecvACK();
	}
	while(--number);
	Stop();                                 //发送停止命令
}
 /**************************************************************************************************************************
 * @brief  I2C读取数据函数
 * @exampleCode
  uint8_t reg,uint8_t *pbuf
  I2C_ReadNbyte(0x7a,reg,pbuf,1); //向0x7a为地址的设备 的reg地址的寄存器 读取数据 长度1字节 并存入pbuf的地址内
 * @endcode
 * @param[in]  addr    指定地址 
 * @param[in]  reg     寄存器地址              
 * @param[in]  *p      写入数据存储位置
 * @param[in]  number  读取数据个数
***************************************************************************************************************************/
void I2C_ReadNbyte(uint8_t addr, uint8_t reg , uint8_t *p, uint8_t number)   
{
	Start();                                //发送起始命令
	SendData(addr);                         //发送设备地址+写命令
	RecvACK();
	SendData(reg);                         //发送存储地址
	RecvACK();
	Start();                                //发送起始命令
	SendData((uint8_t)(addr+1));                         //发送设备地址+读命令
	RecvACK();
	do
	{
		*p = RecvData();
		p++;
		if(number != 1) SendACK();          //send ACK
	}
	while(--number);
	SendNAK();                              //send no ACK	
	Stop();                               //发送停止命令 
}
 /**************************************************************************************************************************
 * @brief  I2C引脚切换函数
 * @exampleCode
   I2C_Change_Pin(IIC_3);
 * @endcode
 * @param[in]  I2C_enum    需要切换到哪组IIC引脚 
***************************************************************************************************************************/
void I2C_Change_Pin(IIC_ENUM I2C_enum)
{
    P_SW2 |= 0x80;//确定使能访问XFR
	
	  P_SW2 &= ~(0x03<<4);	//清除引脚切换位
    switch(I2C_enum)	
    {
    case IIC_1:
        P_SW2 |= (0x00<<4);	//SCL:P1.5	SDA:P1.4
        break;
    case IIC_2:
        P_SW2 |= (0x01<<4);	//SCL:P2.5	SDA:P2.4
        break;
    case IIC_3:
        P_SW2 |= (0x02<<4); //SCL:P7.7	SDA:P7.6 STC8H 48脚核心板没有该组引脚。
        break;
    case IIC_4:
        P_SW2 |= (0x03<<4);	//SCL:P3.2	SDA:P3.3
        break;
    }
	
	P_SW2 |= 0x80;//确定使能访问XFR
}
